Repository: pingfangx/pythonx
Catalog: ToolsX/android_studio_translator/translation_inspection/data/AndroidBundle.tmx
Source language: en_us
Languages: zh_cn

source: Instant Run detected that you are running on a target device that has a work profile or multiple user accounts.<br>
zh_cn: 即时运行检测到您正在具有工作资料或多个用户帐户的目标设备上运行。<br>

source: Instant Run does not support deploying build variants with multidex enabled, to a target with API level 20 or below.<br>
zh_cn: Instant Run不支持将启用了multidex的构建版本部署到具有20级或更低级别API的目标。<br>

source: Instant Run is disabled for current variant.<br>
zh_cn: Instant Run对当前变量禁用。<br>

source: Instant Run is disabled for non-debug variants
zh_cn: 即时运行对非调试的变量禁用

source: Instant Run is disabled for the current variant
zh_cn: 当前变体的Instant Run已禁用

source: Instant Run is disabled since this variant is used specifically for testing
zh_cn: 即时运行被禁用，因为该变体专门用于测试

source: Instant Run is disabled when Jack compiler is used
zh_cn: 使用Jack编译器时，即时运行被禁用

source: Instant Run is disabled when using external native build
zh_cn: 使用外部native构建时即时运行被禁用

source: Instant Run is disabled when using the experimental Android Gradle plugin
zh_cn: 使用实验Android Gradle插件时即时运行被禁用

source: Instant Run is disabled:<br>
zh_cn: 即时运行被禁用：<br>

source: Instant Run performed a clean build and installed the app as requested
zh_cn: 即时运行执行了一个干净的构建并按要求安装了应用程序

source: Instant Run performed a full build and install since<br>
zh_cn: 即时运行执行完整的构建和安装，因为<br>

source: Instant Run requires Android Gradle Plugin version {0}
zh_cn: Instant Run需要Android Gradle插件版本{0}

source: Instant Run restarted the application
zh_cn: 即时运行重新启动应用程序

source: Instrumentation runner class not specified
zh_cn: 没有指定 Instrumentation runner 类

source: Internal error, please check the IDE log
zh_cn: 内部错误，请检查 IDE 日志

source: Invalid Analytics name
zh_cn: 无效的分析名称

source: Invalid ID declaration
zh_cn: ID声明无效

source: Invalid Resource Folder
zh_cn: 资源文件夹无效

source: Invalid Restrictions Descriptor
zh_cn: 无效的限制描述符

source: Invalid application name regex pattern
zh_cn: 无效的应用程序名称正则表达式模式

source: Invalid format string
zh_cn: 无效的格式字符串

source: Invalid log message regex pattern
zh_cn: 无效的日志消息正则表达式模式

source: Invalid log tag regex pattern
zh_cn: 无效的日志标签正则表达式模式

source: Invalid name attribute for uses element
zh_cn: 使用元素的名称属性无效

source: Invalid resource name ''{0}''
zh_cn: 无效的资源名称' ' {0} ' '

source: Invalid string escapes
zh_cn: 无效的字符串转义

source: Key was created with errors
zh_cn: 已创建密钥但有错误

source: Keystore loading error
zh_cn: 密钥库加载错误

source: Launch emulator
zh_cn: 启动模拟器

source: Layout Inflation without a Parent
zh_cn: 布局没有使用父布局加载

source: Layout Inspector
zh_cn: 布局检测

source: Layout Options
zh_cn: 布局选项

source: Layout has too many views
zh_cn: 布局有太多的view

source: Layout hierarchy is too deep
zh_cn: 布局层次太深

source: Leave empty to use defaults.</html>
zh_cn: 留空以使用默认值。</html>

source: Library
zh_cn: 库

source: Library module
zh_cn: 库模块

source: Likely cut & paste mistakes
zh_cn: 可能的剪切和粘贴错误

source: Loading screenshot into memory
zh_cn: 将屏幕截图加载到内存中

source: Location
zh_cn: 位置

source: Log Level
zh_cn: 日志级别

source: Log Message
zh_cn: 日志消息

source: Log Tag
zh_cn: 日志标签

source: Logcat Header
zh_cn: Logcat 标题

source: Malformed Device Admin
zh_cn: 格式错误的设备管理员

source: Mangled file line endings
zh_cn: 错位的文件行结尾

source: Manifest Resource References
zh_cn: 清单资源引用

source: Manifest merging is not supported.
zh_cn: 不支持manifest合并。

source: Me&thod
zh_cn: 方法(&t)

source: Memory allocations within drawing code
zh_cn: 图形代码中的内存分配

source: Menu namespace
zh_cn: 菜单命名空间

source: Method
zh_cn: 方法

source: Method ''{0}'' in ''{1}'' has incorrect signature
zh_cn: ' ' {1} ''中的方法' ' {0} ''具有不正确的签名

source: Method ''{0}'' is missing in ''{1}'' or has incorrect signature
zh_cn: 方法' ' {0} ' '在' ' {1} ''中丢失或具有不正确的签名

source: Method conflicts with new inherited method
zh_cn: 方法与新的继承方法冲突

source: Minimum SDK and target SDK attributes not defined
zh_cn: 未定义最低SDK和目标SDK属性

source: Miscellaneous
zh_cn: 其他

source: Mismatched Log Tags
zh_cn: 不匹配的日志标签

source: Mismatched Styleable/Custom View Name
zh_cn: 不兼容的样式/自定义视图名称

source: Mismatched view type
zh_cn: 不匹配的view类型

source: Missing @IntDef in Switch
zh_cn: 在Switch中缺少@IntDef

source: Missing @JavascriptInterface on methods
zh_cn: 在方法上缺少@JavascriptInterface

source: Missing @Keep for Animated Properties
zh_cn: 缺少@Keep的动画属性

source: Missing Android XML namespace
zh_cn: 缺少Android XML命名空间

source: Missing Backup Pin
zh_cn: 缺少备分Pin

source: Missing Constraints in ConstraintLayout
zh_cn: ConstraintLayout中的缺少约束

source: Missing Gradle Project Information.
zh_cn: 缺少 Gradle 项目信息。

source: Missing Leanback Launcher Intent Filter
zh_cn: 缺少Leanback Launcher意图过滤器

source: Missing Leanback Support
zh_cn: 缺少Leanback支持

source: Missing Parcelable CREATOR field
zh_cn: 缺少Parcelable CREATOR字段

source: Missing Pending Bindings
zh_cn: 缺少 Pending 绑定

source: Missing Super Call
zh_cn: 缺少 Super 调用

source: Missing View constructors for XML inflation
zh_cn: 缺少用于XML加载的View构造函数

source: Missing android:extractNativeLibs manifest attribute
zh_cn: 缺少android:extractNativeLibs清单属性

source: Missing application icon
zh_cn: 缺少应用程序图标

source: Missing application name/version
zh_cn: 缺少应用程序名称/版本

source: Missing baselineAligned attribute
zh_cn: 缺少baselineAligned属性

source: Missing commit() calls
zh_cn: 缺少commit() 调用

source: Missing commit() on SharedPreference editor
zh_cn: 在SharedPreference editor 上缺少commit()

source: Missing density folder
zh_cn: 缺少密度文件夹

source: Missing explicit orientation
zh_cn: 缺少明确的方向

source: Missing inputType or hint
zh_cn: 缺少inputType或hint

source: Missing intent-filter with action android.media.action.MEDIAPLAYFROMSEARCH
zh_cn: 缺少动作为android.media.action.MEDIAPLAYFROMSEARCH的意图过滤器

source: Missing intent-filter with action android.media.browse.MediaBrowserService
zh_cn: 缺少动作为android.media.browse.MediaBrowserService的意图过滤器

source: Missing labelFor attribute
zh_cn: 缺少labelFor属性

source: Missing layoutwidth or layoutheight attributes
zh_cn: 缺少布局宽度或布局高度属性

source: Missing menu title
zh_cn: 缺少菜单标题

source: Missing onPlayFromSearch
zh_cn: 缺少onPlayFromSearch

source: Missing onRefreshToken callback
zh_cn: 缺少onRefreshToken回调

source: Missing quantity translation
zh_cn: 缺少数量翻译

source: Missing recycle() calls
zh_cn: 缺少recycle()调用

source: Missing support for Firebase App Indexing
zh_cn: 缺少对Firebase App Indexing的支持

source: Missing support for Firebase App Indexing Api
zh_cn: 缺少对Firebase App Indexing Api的支持

source: Misspelled namespace declaration
zh_cn: 拼写错误的命名空间声明

source: Multiple <uses-sdk> elements in the manifest
zh_cn: 清单中的多个<uses-sdk>元素

source: My Application
zh_cn: 我的应用程序

source: My Library
zh_cn: 我的库

source: Name and version must be integer or string, not resource
zh_cn: 名称和版本必须是整数或字符串，而不是资源

source: Native code outside library directory
zh_cn: 库外的本地代码目录

source: Navigate to Android resource definition
zh_cn: 导航到 Android 资源定义

source: Negative Margins
zh_cn: 负边距

source: Nested layout weights
zh_cn: 嵌套布局权重

source: Nested scrolling widgets
zh_cn: 嵌套滚动的部件

source: Network Latency
zh_cn: 网络延迟

source: Network Speed
zh_cn: 网络速度

source: New Android Activity
zh_cn: 新 Android Activity

source: New Android Component
zh_cn: 新 Android 组件

source: New Module
zh_cn: 新建模块

source: New Resource Directory
zh_cn: 新资源目录

source: New Resource File
zh_cn: 新资源文件

source: New resource directory
zh_cn: 新资源目录

source: New resource file
zh_cn: 新资源文件

source: New source root name is NOT propagated<br/>to Gradle config automatically.<br/>You need to make corresponding<br/>change at *.gradle file(s) manually
zh_cn: 新的源码根名称不会自动传播给Gradle配置。<br/>您需要在* .gradle文件中进行相应的更改（ s）

source: New {0} Resource File
zh_cn: 新的 {0} 资源文件

source: New {0} resource file
zh_cn: 新的 {0} 资源文件

source: Newer Library Versions Available
zh_cn: 更新的库版本可用

source: No Android facet found for {0}
zh_cn: 没有找到 {0} 的 Android facet

source: No Filters
zh_cn: 没有过滤器

source: No Java SDK of appropriate version found.
zh_cn: 找不到适合版本的 Java SDK。

source: No appropriate JDK is found
zh_cn: 找不到合适的 JDK

source: No changes to deploy
zh_cn: 没有更改变应用

source: No product flavors defined
zh_cn: 没有定义产品 flavors

source: No target device found
zh_cn: 找不到目标设备

source: Node can be replaced by a TextView with compound drawables
zh_cn: 节点可以替换为具有compound drawables的TextView

source: Non-constant resource ID in a switch statement
zh_cn: switch语句中的非常量资源ID

source: Not a valid Activity name "{0}"
zh_cn: 不是有效的 Activity 名称“ {0} ”

source: Not a valid package name "{0}"
zh_cn: 不是有效的包名“ {0} ”

source: Not overriding abstract methods on older platforms
zh_cn: 不会在较老的平台上覆盖抽象方法

source: Obsolete Gradle Dependency
zh_cn: 过时的Gradle依赖关系

source: Obsolete SDKINT Version Check
zh_cn: 已过时的SDKINT版本检查

source: Obsolete layout params
zh_cn: 过时的布局参数

source: Obtain a screenshot from the device
zh_cn: 从设备获取屏幕截图

source: Obtaining screenshot from device
zh_cn: 从设备获取屏幕截图

source: Only compatible AVDs are shown.
zh_cn: 仅显示兼容的AVD。

source: Only integer value is allowed
zh_cn: 仅允许整数值

source: Open the Firebase Assistant
zh_cn: 打开Firebase Assistant

source: Organization
zh_cn: 组织

source: Organizational Unit
zh_cn: 组织单位

source: Other typographical problems
zh_cn: 其他排版问题

source: Overdraw: Painting regions more than once
zh_cn: Overdraw：多次绘制区域

source: Overlapping Enumeration Constants
zh_cn: 重复枚举常量

source: Overlapping items in RelativeLayout
zh_cn: RelativeLayout中的重叠项

source: PID must be a positive integer
zh_cn: PID必须是正整数

source: Package
zh_cn: 包

source: Package Name
zh_cn: 包名

source: Package is not specified in the manifest file
zh_cn: 在清单文件中未指定包

source: Package name is too long
zh_cn: 包名太长

source: Packaged private key
zh_cn: 打包的私有密钥

source: Padding and margin symmetry
zh_cn: Padding 和 margin 对称

source: Password
zh_cn: 密码

source: Password must be at least 6 characters
zh_cn: 密码必须至少为6个字符

source: Passwords do not match
zh_cn: 密码不匹配

source: Path does not exist
zh_cn: 路径不存在

source: Path is empty
zh_cn: 路径为空

source: Perform Analysis
zh_cn: 执行分析

source: Performing full build and install:<br>
zh_cn: 执行完整的构建和安装：<br>

source: Permission Implies Unsupported Hardware
zh_cn: 权限不支持的硬件

source: Permission attribute declared on invalid element
zh_cn: 在无效元素上声明的权限属性

source: Permission names are not unique
zh_cn: 权限名称不唯一

source: Phone \& Tablet Module
zh_cn: 手机 \& 平板模块

source: Please check SDK
zh_cn: 请检查 SDK

source: Please check if the IDE successfully synchronized its state with
zh_cn: 请检查 IDE 是否成功同步其状态

source: Please check the following options:
zh_cn: 请检查以下选项：

source: Please choose Android SDK location
zh_cn: 请选择 Android SDK 位置

source: Please close other application using ADB: Monitor, DDMS, Eclipse
zh_cn: 请选择正在使用 ADB的其他程序 : Monitor, DDMS, Eclipse

source: Please close the emulator
zh_cn: 请关闭模拟器

source: Please configure internal JDK
zh_cn: 请配置内部 JDK

source: Please describe your Instant Run Issue
zh_cn: 请描述您的即时运行问题

source: Please enter an application name (shown in launcher), or a descriptive name for your library
zh_cn: 请输入应用程序名称（显示在启动器中）或库的描述性名称

source: Please manually retrieve the file from the device using
zh_cn: 请使用设备手动检索文件

source: Please reconfigure it in Android facet settings
zh_cn: 请在Android facet设置中配置

source: Please select Android SDK
zh_cn: 请选择 Android SDK

source: Please select Android Target
zh_cn: 请选择 Android 目标

source: Please select alias
zh_cn: 请选择别名

source: Please select at least one of the signature versions to use
zh_cn: 请至少选择一个要使用的签名版本

source: Please select compatible AVD
zh_cn: 请选择兼容的 AVD

source: Please select the product flavors to build and sign
zh_cn: 请选择产品 flavors 进行构建和签名

source: Please specify AVD name
zh_cn: 请指定 AVD 名称

source: Please specify Android SDK
zh_cn: 请指定 Android SDK

source: Please specify ProGuard config file path
zh_cn: 请指定ProGuard配置文件路径

source: Please specify destination APK path
zh_cn: 请指定目标 APK 路径

source: Please specify destination folder for the signed APKs
zh_cn: 请指定签名 APK 的目标文件夹

source: Please specify key alias
zh_cn: 请指定密钥别名

source: Please specify keystore location
zh_cn: 请指定密钥库位置

source: Please specify password
zh_cn: 请指定密码

source: Please specify password for key
zh_cn: 请指定 key 的密码

source: Please specify password for key store
zh_cn: 请指定密钥库的密码

source: Please specify tested module
zh_cn: 请指定测试模块

source: Please update it in <a href="#">Settings</a>
zh_cn: 请在 <a href="#">设置</a> 中更新它

source: Please, check Android facet settings
zh_cn: 请检查 Android facet 设置

source: Please, reconfigure your manifest files
zh_cn: 请重新配置您的清单文件

source: Possibly Android SDK is not specified
zh_cn: 可能没有指定 Android SDK。

source: Potential AAPT crash
zh_cn: 潜在的AAPT崩溃

source: Potential App Links Auto Verification Failure
zh_cn: 潜在的应用程序链接自动验证失败

source: Potential Multiple Certificate Exploit
zh_cn: 潜在的多个证书利用

source: Potential Plurals
zh_cn: 潜在的多个

source: Prefer Android Virtual Device
zh_cn: 偏好Android虚拟设备

source: PreferenceActivity should not be exported
zh_cn: PreferenceActivity不应该是导出的

source: Press the "Do RTL Refactor" button at the bottom of the search results panel to proceed with the right-to-left (RTL) refactoring
zh_cn: 按搜索结果面板底部的“Do RTL Refactor”按钮继续从右到左（RTL）重构

source: Preview
zh_cn: 预览

source: Processing external apklib dependencies
zh_cn: 处理外部的apklib依赖关系

source: Proguard.cfg file contains generic Android rules
zh_cn: Proguard.cfg文件包含通用的Android规则

source: Project already contains subproject with name {0}
zh_cn: 项目已经包含名为 {0} 的子项目

source: R.java and Manifest.java files
zh_cn: R.java 和 Manifest.java 文件

source: Receiver does not require permission
zh_cn: Receiver未要求权限

source: Record a video of the device display
zh_cn: 记录一段设备显示的视频

source: Record all allocations that occur while tracking is active
zh_cn: 记录跟踪活动时发生的所有分配

source: RecyclerView Problems
zh_cn: RecyclerView问题

source: Reference to an id that is not in the current layout
zh_cn: 引用不在当前布局中的id

source: Reference to an unknown id
zh_cn: 引用一个未知的id

source: Refresh
zh_cn: 刷新

source: Regenerate Java files when AIDL files are changed
zh_cn: 当 AIDL 文件被更改时，重新生成 Java 文件

source: Regenerate R.java file when resources are changed
zh_cn: 当资源更改时重新生成 R.java 文件

source: RelativeLayout Invalid Constraints
zh_cn: RelativeLayout无效的约束

source: Remote Interface
zh_cn: 远程接口

source: Remove
zh_cn: 移除

source: Remove Parcelable Implementation
zh_cn: 移除 Parcelable 实现

source: Remove attribute
zh_cn: 移除属性

source: Remove selected logcat filter
zh_cn: 删除所选的logcat过滤器

source: Remove unnecessary view
zh_cn: 移除不必要的view

source: Rename
zh_cn: 重命名

source: Rename alternative resources for other configurations?
zh_cn: 重命名其他配置的可选资源？

source: Rename manifest package
zh_cn: 重命名manifest包

source: Rename resource "{0}"?
zh_cn: 重命名资源“{0}”？

source: Rename resource {0} to
zh_cn: 将资源 {0} 重命名为

source: Replace Left/Right Properties with Start/End Properties
zh_cn: 用 Start/End 属性替换 Left/Right 属性

source: Replace Parcelable Implementation
zh_cn: 替换 Parcelable 实现

source: Replace size attribute with 'wrapcontent'
zh_cn: 使用' wrapcontent ' 替换大小属性

source: Replace size attribute with 0dp
zh_cn: 用0dp替换大小属性

source: Replace with an auto resource namespace
zh_cn: 替换为auto资源命名空间

source: Replace with suggested characters
zh_cn: 替换为建议的字符

source: Replace?
zh_cn: 更换？

source: Report Instant Run Issue
zh_cn: 报告Instant Run问题

source: Report to Google
zh_cn: 向Google报告

source: Repositories
zh_cn: 库

source: Res-overlay directories
zh_cn: 重新覆盖目录

source: Resource IDs cannot be used in a switch statement in Android library modules
zh_cn: 资源ID不能在Android库模块中的switch语句中使用

source: Resource file in the wrong res folder
zh_cn: 资源文件在错误的res文件夹中

source: Resource name
zh_cn: 资源名称

source: Resource with Wrong Prefix
zh_cn: 资源错误的前缀

source: Resources Packaging
zh_cn: 资源打包

source: Restart
zh_cn: 重启

source: Restart ADB integration and try again
zh_cn: 重新启动ADB集成，然后重试

source: Restart logging
zh_cn: 重新启动日志记录

source: Right-to-left text compatibility issues
zh_cn: 从右到左的文本兼容性问题

source: Root element is not specified
zh_cn: 未指定根元素

source: Run
zh_cn: 运行

source: Run "process-resources" Maven task before Make
zh_cn: 在编译前运行 "process-resources" Maven 任务

source: Run ProGuard
zh_cn: 运行ProGuard

source: Run ProGuard when building debug APK
zh_cn: 构建调试APK时运行ProGuard

source: Run detected that a resource referenced from the merged AndroidManifest has changed.
zh_cn: 运行检测到从合并的AndroidManifest引用的资源已更改。

source: Run does not support deploying to multiple targets.<br>
zh_cn: 运行不支持部署到多个目标。<br>

source: Run does not support running the app under a work profile or as a secondary user.<br>
zh_cn: 运行不支持在工作配置文件或辅助用户下运行应用程序。<br>

source: Run is not supported on devices with API levels 20 or lower
zh_cn: API级别为20或更低的设备不支持运行

source: Run issues.</html>
zh_cn: 运行问题。</html>

source: Run requires that the Android SDK for the API level of the device you are deploying to is installed.<br>
zh_cn: 运行需要安装要部署的设备的API级别的Android SDK。<br>

source: Run requires that the platform corresponding to your target device ({0}) is installed
zh_cn: 运行需要安装与您的目标设备（{0}）对应的平台

source: SDK Manager
zh_cn: SDK 管理

source: SMS phone number missing country code
zh_cn: 短信电话号码丢失国家代码

source: Save
zh_cn: 保存

source: Save As .9.png
zh_cn: 另存为.9.png

source: Save as PNG
zh_cn: 另存为PNG

source: Screen Capture
zh_cn: 屏幕捕获

source: Screen Record
zh_cn: 屏幕记录

source: ScrollView size validation
zh_cn: ScrollView大小验证

source: ScrollViews can have only one child
zh_cn: ScrollViews只能有一个child

source: See 'uses-sdk' tag in AndroidManifest.xml
zh_cn: 见AndroidManifest.xml中的 'uses-sdk' 标签

source: Select Android Virtual Device
zh_cn: 选择 Android 虚拟设备

source: Select Deployment Target
zh_cn: 选择部署目标

source: Select Instrumentation class
zh_cn: 选择 Instrumentation 类

source: Select Package
zh_cn: 选择包

source: Select SDCard file
zh_cn: 选择 SDCard 文件

source: Select Source Location
zh_cn: 选择源码位置

source: Select Test class
zh_cn: 选择测试类

source: Select Window
zh_cn: 选择窗口

source: Select existing ADT or Gradle project to import as a new subproject
zh_cn: 选择现有的 ADT 或 Gradle 项目作为新的子项目导入

source: Select jar or aar package to import as a new module
zh_cn: 选择 jar 或 aar 包作为新模块导入

source: Select modules to import
zh_cn: 选择要导入的模块

source: Set 'baselineAligned' attribute
zh_cn: 设置' baselineAligned '属性

source: Short or Frequent Alarm
zh_cn: 短路或频繁报警

source: Should use valueOf instead of new
zh_cn: 应该使用valueOf而不是new

source: Show chooser dialog
zh_cn: 显示选择器对话框

source: Show date and time
zh_cn: 显示日期和时间

source: Show device chooser dialog
zh_cn: 显示设备选择对话框

source: Show only selected application
zh_cn: 仅显示所选应用程序

source: Show package name
zh_cn: 显示包名

source: Show process and thread IDs (PID-TID)
zh_cn: 显示进程和线程ID（PID-TID）

source: Show tag
zh_cn: 显示标签

source: Size
zh_cn: 大小

source: Specific instrumentation runner (optional)
zh_cn: 具体的 instrumentation runner（可选）

source: Specify location of the Gradle or Android Eclipse project
zh_cn: 指定 Gradle 或 Android Eclipse 项目的位置

source: Specify one or several filtering parameters
zh_cn: 指定一个或多个过滤参数

source: Spelling error
zh_cn: 拼写错误

source: Start Allocation Tracking
zh_cn: 开始分配跟踪

source: Start Method Tracing
zh_cn: 开始方法跟踪

source: Start Recording
zh_cn: 开始录制

source: State or Province
zh_cn: 州或省

source: Static Field Leaks
zh_cn: 静态字段泄漏

source: Stop Allocation Tracking
zh_cn: 停止分配跟踪

source: Stop Method Tracing
zh_cn: 停止方法跟踪

source: Straight quotes can be replaced with curvy quotes
zh_cn: 直线引号可以用弯曲的引号代替

source: String should be int
zh_cn: String应为int

source: String.format string doesn't match the XML format string
zh_cn: String.format 字符串不匹配XML格式的字符串

source: Subproject name is required
zh_cn: 子项目名称是必需的

source: Suppress: Add @SuppressLint("{0}") annotation
zh_cn: 抑制：添加@SuppressLint（“{0}”）注释

source: Suppress: Add tools:ignore="{0}" attribute
zh_cn: 抑制：添加 tools:ignore="{0}" 属性

source: Suspicious 0dp dimension
zh_cn: 可疑的0dp尺寸

source: Suspicious Language/Region Combination
zh_cn: 可疑语言/区域组合

source: TV Missing Banner
zh_cn: 电视丢失横幅

source: TV apps require restarting for all changes
zh_cn: TV 应用程序需要重新启动所有更改

source: Tagged object leaks
zh_cn: 标签对象泄漏

source: Target Device
zh_cn: 目标设备

source: Target SDK attribute is not targeting latest version
zh_cn: 目标SDK属性未定位到最新版本

source: Target package is not specified in AndroidManifest.xml
zh_cn: 目标包未在 AndroidManifest.xml 中指定

source: Terminate Application
zh_cn: 终止应用程序

source: Terminates selected Android Application
zh_cn: 终止选定的Android应用程序

source: Test
zh_cn: 测试

source: Tested module
zh_cn: 测试模块

source: Tested module must contain Android facet
zh_cn: 测试模块必须包含 Android facet

source: Text size is too small
zh_cn: 文本大小太小

source: TextView Internationalization
zh_cn: TextView国际化

source: TextView should probably be an EditText instead
zh_cn: TextView应该是一个EditText

source: The <b>download size</b> is the estimated size of the file for new installations (Google Play serves a highly compressed version of the file).
zh_cn: <b>download size</b> 是新安装文件的估计大小(Google Play 提供了文件的高压缩版本)。

source: The <b>raw size</b> reflects the actual size of the file, and is the minimum amount of space it will consume on the disk after installation.
zh_cn: <b>raw size</b> 反映文件的实际大小，是安装后在磁盘占用的最小空间量。

source: The activity ''{0}'' does not have the launcher intent
zh_cn: Activity “{0}”没有 launcher intent

source: The activity ''{0}'' is declared in a library module, but manifest merging is disabled for app module ''{1}''
zh_cn: 在一个库模块中声明了 Activity “{0}”，但 app 模块“{1}”禁用了 manifest 合并。

source: The activity ''{0}'' is not declared in AndroidManifest.xml
zh_cn: 在 AndroidManifest.xml 中未声明 Activity “{0}”

source: The activity must be exported or contain an intent-filter
zh_cn: Activity 必须是 exported 或包含一个 intent-filter

source: The apk for your currently selected variant ({0}) is not signed
zh_cn: 您当前选择的变体（{0}）的apk未签名

source: The application name for most apps begins with an uppercase letter
zh_cn: 大多数应用程序的应用程序名称以大写字母开头

source: The current project can not be run
zh_cn: 当前项目无法运行

source: The currently selected Gradle build type does not support instrumentation tests
zh_cn: 当前选择的 Gradle 构建类型不支持 instrumentation 测试

source: The currently selected variant "{0}" uses split APKs, but none of the {1} split apks are compatible
zh_cn: 当前选择的变体“ {0} ”使用拆分APK，但没有{1}拆分apks兼容

source: The destination folder does not exist or is not writeable
zh_cn: 目标文件夹不存在或不可写

source: The launcher icon shape should use a distinct silhouette
zh_cn: 启动器图标形状应使用明显的轮廓

source: The module cannot be Android library
zh_cn: 该模块不能是 Android 库

source: The project contains errors
zh_cn: 项目包含错误

source: The structure of following Android modules was changed:<br>{0}<br>Would you like to update related project.properties files?<br>
zh_cn: 以下Android模块的结构已更改：<br> {0} <br>是否要更新相关的project.properties文件？<br>

source: There is no Android facets in the project
zh_cn: 项目中没有 Android facets

source: These logs contain project details that may include personally<br>
zh_cn: 这些日志可能包括个人项目详细信息<br>

source: Third-party
zh_cn: 第三方

source: This location is already imported
zh_cn: 此位置已导入

source: This may result in missing dependencies
zh_cn: 这可能导致缺少依赖关系

source: This refactoring will add RTL support to your Android App.
zh_cn: 这个重构将会为您的Android应用添加RTL支持。

source: Toast created but not shown
zh_cn: Toast创建但未显示

source: Too Long Log Tags
zh_cn: 太长的日志标签

source: Try to force reimport from Maven model
zh_cn: 尝试强制从Maven模型重新导入

source: URL not supported by app for Firebase App Indexing
zh_cn: Firefox应用程序索引不支持的应用程序

source: USB device
zh_cn: USB设备

source: Unable to find sources for %1$s and %2$d more subprojects.
zh_cn: 无法找到 %1$s 和 %2$s 及更多子项目的源码。

source: Unable to find sources for subproject %1$s.
zh_cn: 无法找到子项目 %1$s 的源码。

source: Unable to find sources for subprojects %1$s and %2$s.
zh_cn: 无法找到子项目 %1$s 和 %2$s 的源码。

source: Unable to get the output folder of the project
zh_cn: 无法获取项目的输出文件夹

source: Unconditional Logging Calls
zh_cn: 无条件日志记录

source: Unexpected error while creating 9-Patch file: {0}
zh_cn: 创建9-Patch文件时出现意外错误：{0}

source: Unexpected error while obtaining screenshot from device: {0}
zh_cn: 从设备获取屏幕截图时出现意外错误：{0}
